import * as allFunctions from "./functions/functions.js"

///// О С Н О В Н І     Ф У Н К Ц І Ї ==========================================================================================================================================================================================
//Тип пристрою touch або pc
allFunctions.addTouchClass()

//Робота з меню (бургер)
allFunctions.menuBurger()

//// С К Р О Л ==========================================================================================================================================================================================
import * as allScroll from "./functions/scroll.js"

// Робота з шапкою 
// allScroll.headerScroll()

//Робота з анімацією 
allScroll.animOnScroll()

//Робота з плавною прокруткою
allScroll.goToBlock()




//Робота зі своїм кодом
import "./functions/script.js"